///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заголовок = Параметры.Заголовок;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьТекстОшибки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьНастройки" Тогда
		СтандартнаяОбработка = Ложь;
		РаботаСФайламиКлиент.ОткрытьФормуНастройкиСканирования();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ТехническаяИнформация" Тогда
		СтандартнаяОбработка = Ложь;
		ПолучитьТехническуюИнформацию();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПовторитьСканирование(Команда)
	Закрыть("ПовторитьСканирование");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьТекстОшибки()
	Рекомендации = Новый Массив;
	Рекомендации.Добавить(НСтр("ru = 'Проверьте подключение сканера и повторите попытку сканирования.'"));
	Рекомендации.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Укажите в <a href = ""%1"">настройках сканирования</a> доступный сканер.'"),
		"ОткрытьНастройки"));

	Если Не Параметры.ПоказыватьДиалогСканера И Не ОбщегоНазначенияКлиент.ЭтоLinuxКлиент() Тогда
		Рекомендации.Добавить(НСтр("ru = 'Смените способ задания настроек на <b>Расширенные в диалоге сканера</b>.'"));
	КонецЕсли;
	
	Если Параметры.ПоказыватьДиалогСканера 
		Или Параметры.Разрешение = ПредопределенноеЗначение("Перечисление.РазрешенияСканированногоИзображения.dpi1200") Тогда
		Рекомендации.Добавить(НСтр("ru = 'Снизьте разрешение сканирования до <b>600 dpi</b>.'"));
	КонецЕсли;

	СистемнаяИнформация = Новый СистемнаяИнформация();
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Рекомендации.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Установите и запустите <a href = ""%1"">тонкий клиент 1С:Предприятия для Windows (32-bit)</a>, 
				|  в котором доступно больше устройств и настроек сканирования.'"), 
				"Запустить32БитныйКлиент"));
	КонецЕсли;

	Если Параметры.РежимТребуетсяПомощь Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сканирование выполняется с помощью %1.'"), 
			Параметры.ИмяУстройстваСканирования);
	Иначе
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сканер ""%1"" не обнаружен или не подключен.'"), 
			Параметры.ИмяУстройстваСканирования);
	КонецЕсли;		

	ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС 
		+ НСтр("ru = 'Попробуйте следующие варианты:'") + Символы.ПС
		+ " • " + СтрСоединить(Рекомендации, Символы.ПС + " • ");
	ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС 
		+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Если проблема повторится, обратитесь в службу поддержки фирмы ""1С"", 
				|предоставив <a href = ""%1"">техническую информацию</a> о возникшей проблеме.'"), 
		"ТехническаяИнформация");
	
	Элементы.ТекстОшибки.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(ТекстОшибки);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТехническуюИнформацию()
	РаботаСФайламиСлужебныйКлиент.ПолучитьТехническуюИнформацию(Параметры.ПодробноеПредставлениеОшибки);
КонецПроцедуры

#КонецОбласти
