
#Область ПрограммныйИнтерфейс


Процедура ОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Источник.Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры


// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

